{
  "apiVersion" : "1.0",
  "swaggerVersion" : "1.2",
  "basePath" : "http://localhost:8080/uaa",
  "resourcePath" : "/PasswordCheckEndpoint",
  "produces" : [ "application/json" ],
  "consumes" : [ "application/x-www-form-encoded" ],
  "protocols" : [ ],
  "authorizations" : [ ],
  "apis" : [ {
    "path" : "/password/score",
    "operations" : [ {
      "method" : "POST",
      "summary" : "Query the strength of a password",
      "notes" : "The password strength API is not part of SCIM but is provided as a service to allow user management applications to use the same password quality checking mechanism as the UAA itself. Rather than specifying a set of rules based on the included character types (upper and lower case, digits, symbols etc), the UAA exposes this API which accepts a candidate password and returns a JSON message containing a simple numeric score (between 0 and 10) and a required score (one which is acceptable to the UAA). The score is based on a calculation using the ideas from the zxcvbn project.\nThe use of this API does not guarantee that a password is strong (it is currently limited to English dictionary searches, for example), but it will protect against some of the worst choices that people make and will not unnecessarily penalise strong passwords. In addition to the password parameter itself, the client can pass a comma-separated list of user-specific data in the userData parameter. This can be used to pass things like the username, email or other biographical information known to the client which should result in a low score if it is used as part of the password.",
      "responseClass" : "PasswordScore",
      "nickname" : "passwordScore",
      "protocols" : [ ],
      "authorizations" : [ ],
      "parameters" : [ {
        "name" : "password",
        "required" : true,
        "allowMultiple" : false,
        "dataType" : "String",
        "allowableValues" : null,
        "paramType" : "form"
      }, {
        "name" : "userData",
        "description" : "comma separated list of user-specfic data",
        "required" : true,
        "allowMultiple" : false,
        "dataType" : "String",
        "allowableValues" : null,
        "paramType" : "form"
      } ],
      "responseMessages" : [ ]
    } ]
  } ],
  "models" : {
	  "PasswordScore": {
	    "id": "PasswordScore",
	    "description": "strength of a password",
	    "required": [
	      "score",
	      "requiredScore"
	    ],
	    "properties": {
	      "score": {
	        "type": "string"
	      },
	      "requiredScore": {
	        "type": "string"
	      }
	    }
	  }
  }
}